# Вам нужно найти все рецепты, в которых используются «Яйца».

    # Прочитайте файл recipes.json.
    # Переберите в цикле список рецептов. Для каждого рецепта переберите его список ингредиентов.
    # Если рецепт содержит «Яйца», добавьте весь объект этого рецепта в новый список.
    # После проверки всех рецептов запишите этот новый список «рецептов на основе яиц» в новый файл под названием egg_recipes.json.

# Дополнительное задание: 
# Создайте функцию find_recipes_by_ingredient(ingredient_name), 
# которая принимает название ингредиента в качестве аргумента и 
# создает соответствующий файл (например, chicken_recipes.json, если вы ищете «Куриная грудка»).

import json 
# Далее ваш код ...