# Прибыла новая поставка! 
# Напишите скрипт на Python для обновления количества товара «Клавиатура».

    # Прочитайте файл inventory.json. Данные будут представлять собой список словарей.
    # Найдите в списке словарь для товара с названием «Клавиатура».
    # Увеличьте значение в ключе "stock" на 50.
    # Запишите весь обновленный список товаров обратно в файл inventory.json.
    # Используйте отступ в 4 пробела, чтобы файл был читаемым (json.dump(data, file, indent=4)).

# Дополнительное задание: 
# После обновления клавиатуры добавьте в инвентарь новый товар. 
# Например, добавьте «Веб-камера» с id 104, количеством 30 и ценой 55.00. 
# Затем запишите обновленный список (с обновленным количеством и новым товаром) обратно в файл.

import json
# Далее ваш код ...